/*
Числа с плавающей точкой
double (размер 8 байт , описывает вещественные чилса двойной точности)
float   (размер 4 байта , описывает вещественные чилса одинарной точности)
Целые числа 
int (размер 4 байта , описывает целые числа , диапозон от -2147483648 до 2147483648)
short (размер 2 байта , описывает короткие целые числа , диапозон от -32768 до 32767)
long (размер 4 байта , описывает длинные целые числа , диапозон от -2147483648 до 2147483648 )
символьный тип
char(размер 1 байт , описывает символы)
логический тип
bool (размер 1 байт , принимает значения true и false , описывает логические значения)


















*/