#include<iostream>//подключаем библиотеку ввода и вывода 

using namespace std; //объявление пространства имен std


void main(){
	int a; //объявление переменной
	bool t;//объявление переменной
	char c;//объявление переменной
	short f;//объявление переменной
	float n;//объявление переменной
	double v;//объявление переменной
	
	a=1;//присваиваем значение переменной a
	t=true;//присваиваем значение переменной t
	c=c;//присваиваем значение переменной c
	f=1;//присваиваем значение переменной f
	n=1.21;//присваиваем значение переменной n
	v=1.123123;//присваиваем значение переменной v
	
	
	cout <<"int "<<a<<" bool "<<t<<" char "<<c<<" short "<<f<<" float "<<n<<" double "<<v<<endl;//вывод в концоль переменных с переходом на новую строку
	
	
	
	
	
	
}